[
  {
    "num": 20,
    "data": "aaron_semer",
    "artist": "Aaron Semer",
    "albumTitle": "Cape Disappointment",
    "art": "aaron_semer",
    "artCredit": "Painting by Adam Burke, Design by AJ Hanneld",
    "spotify": "https://open.spotify.com/embed/album/7IXge8jRImgWSQiIXnk6H5",
    "text": "A gifted storyteller with an easygoing, guy-on-a-Ballard-barstool delivery, folk-rock singer-songwriter Aaron Semer unleashed this no-nonsense “midlife crisis album” (his words) last month with echoes of Warren Zevon, Neil Young and Jeff Tweedy. Whether serving up kazoo-tooting takedowns of empty social-media activism, folk-punk sizzlers hotter than a diner grease fire, or stripped-down solo acoustic numbers, Semer’s songs — written largely in a small-town trailer near Cape Disappointment State Park — have a familiarity about them, like they’ve been a part of your life for years. Maybe they should be."
  },
  {
    "num": 19,
    "data": "ben_zaidi",
    "artist": "Ben Zaidi and Budo",
    "albumTitle": "Abandonism.",
    "art": "ben_zaidi",
    "artCredit": "Jacob Lee",
    "spotify": "https://open.spotify.com/embed/album/4Ito0VrvsXYNnUc3rTltGI",
    "text": "This collaboration from Seattle standouts Ben Zaidi and veteran hip-hop producer Budo yielded a polished, understated alt-pop gem. It’s a natural pairing for the now New York City-based Zaidi, a keyboard-playing singer-songwriter of the James Blake-ian ilk who has become a regular collaborator with local rappers like Sol and Travis Thompson. Glitchy, manipulated vocal snippets dress up poignantly spacious, piano-laced beats, letting Zaidi’s pensive bedroom croon shine."
  },
  {
    "num": 18,
    "data": "sassyblack",
    "artist": "SassyBlack",
    "albumTitle": "Ancient Mahogany Gold",
    "art": "sassyblack",
    "artCredit": "Wutang McDougal",
    "spotify": "https://open.spotify.com/embed/album/21RHVSCjkf7rBrq1Qvjbhi",
    "text": "“I’m from space, I’m not from this earth,” professes Seattle’s cosmic R&B queen on funky, synth-clunking album closer “Black Excellence.” We’re inclined to believe her. The third solo album from THEESatisfaction alum <a href=\"https://www.seattletimes.com/entertainment/music/this-is-cool-music-a-younger-crew-of-seattle-jazz-informed-musicians-bend-genres-creating-their-own-sound/\" target=\"_blank\" rel=\"noopener noreferrer\">SassyBlack</a> is likely to send body and mind (not necessarily together) into the thermosphere with the wavy synths and nimble bass lines of the aptly titled “Sweet Vibes” and starry glider “Depression.” It’s no wonder her holistic new record, born into the galaxy this fall, inspired a cannabis oil of the same name."
  },
  {
    "num": 17,
    "data": "navvi",
    "artist": "NAVVI",
    "albumTitle": 2502,
    "art": "navvi",
    "artCredit": "Bethany Vargas, Kristin Henry and Brad Boettger",
    "spotify": "https://open.spotify.com/embed/album/4ltQJ3szkNZ32XUtxNJqaq",
    "text": "Master builders of atmospheric dance-floor movers, NAVVI dropped off this savory late-summer EP, reminding us why the electro-pop tandem of Kristin Henry and Brad Boettger is at the top of its class. The duo is indeed “All Finesse” on the track of the same name, Henry’s vaporous vocals weaving in and out of an immersive house beat with bright synth leads always lurking around the bend. Dare you to stand still."
  },
  {
    "num": 16,
    "data": "black_ends",
    "artist": "Black Ends",
    "albumTitle": "Sellout",
    "art": "black_ends",
    "artCredit": "María Granados",
    "spotify": "https://open.spotify.com/embed/album/54EHql2tlLN2sX5gv2i9r7",
    "text": "It may have been <a href=\"https://www.seattletimes.com/entertainment/music/7-new-seattle-albums-you-need-to-hear/\" target=\"_blank\" rel=\"noopener noreferrer\">The Black Tones’ release party</a>, but a sold-out Chop Suey show at the beginning of 2019 also felt like a coming-out party for Black Ends, one of Seattle’s best new rock bands, which impressed with a rambunctiously tousled set. The trio, led by singer/guitarist Nicolle Swims, dropped its wiry debut EP, marked by Swims’ frazzling, spiky guitar work and wry vocal delivery. While the title track’s an art-punk ripper, the moody “Maybe When” cools down into a dark and swaggering garage-rock groove."
  },
  {
    "num": 15,
    "data": "julia_shapiro",
    "artist": "Julia Shapiro",
    "albumTitle": "Perfect Version",
    "art": "julia_shapiro",
    "artCredit": "Hardly Art",
    "spotify": "https://open.spotify.com/embed/album/43FQQVHJfUZzflPXa0Fg82",
    "text": "It wasn’t exactly on <a href=\"https://www.seattletimes.com/entertainment/music/chastity-belts-julia-shapiro-steps-out-with-impressive-soul-searching-solo-debut-perfect-version/\" target=\"_blank\" rel=\"noopener noreferrer\">Julia Shapiro’s agenda</a>, but the veteran indie rocker’s impressive solo debut was the happiest accident of 2019. During some time off from her primary band, Chastity Belt, Shapiro cut a dozen beautifully vulnerable, soul-searching songs. More than half were written and recorded in Shapiro’s apartment, lending added intimacy to an almost stream-of-consciousness lyricism that pulls listeners into her internal conversation while navigating a mid-20s identity crisis."
  },
  {
    "num": 14,
    "data": "actionesse",
    "artist": "Actionesse",
    "albumTitle": "The Deep, Bright Below",
    "art": "actionesse",
    "artCredit": "NODRA and Actionesse",
    "spotify": "https://open.spotify.com/embed/album/5O7EwrLFhSX4g1HlxHwosa",
    "text": "There’s something uniquely delightful about punk rockers unleashing torrents of sax and trombone without sliding into a pair of checkered Vans for a walk on the ska side. The first full-length from this self-described “post-horncore” quintet sounds like the result of grown-up band kids who once sprinted from after-school practice to the nearest house-basement punk-show mosh pit, maniacally chugging and thrashing with blistered vocals and an aversion to self-seriousness."
  },
  {
    "num": 13,
    "data": "dave_b",
    "artist": "Dave B",
    "albumTitle": "Bleu",
    "art": "dave_b",
    "artCredit": "Léa Godoy",
    "spotify": "https://open.spotify.com/embed/album/5su1Y0MrRthyjNELk7QroA",
    "text": "With his fourth album, the proven emcee further bolsters his credentials as one of Seattle hip-hop’s <a href=\"https://www.seattletimes.com/entertainment/music/seattle-rapper-dave-b-riding-wave-of-momentum-plays-at-neptune/\" target=\"_blank\" rel=\"noopener noreferrer\" >top dual threats</a>, splicing gospel-splashed singing passages into his nasally bars with aplomb. The 10-track introspective journey carries nods to late Seattle luminaries Kari Ca$h and J Moore, with Dave’s unflappable flow belying the internal tension in his lyrics."
  },
  {
    "num": 12,
    "data": "versing",
    "artist": "Versing",
    "albumTitle": 10000,
    "art": "versing",
    "artCredit": "Hardly Art",
    "spotify": "https://open.spotify.com/embed/album/4cZRvV3CRAXxhrCY7RKOgA",
    "text": "Having climbed the Seattle rock ranks over the last few years, Versing was scooped up by Hardly Art ahead of its rumbling sophomore full-length album. The dynamic quartet’s first effort for the Sub Pop imprint makes good on its new platform, arriving awash in warm, reverberating guitar tones while wielding elements of slacker rock, shoegaze and punk, slotting neatly into none of those. Barbed guitar leads splash against walls of Sonic Youth-indebted dissonance that never consume singer/guitarist Daniel Salas’ magnificently dour melodies."
  },
  {
    "num": 11,
    "data": "livt",
    "artist": "LIV†",
    "albumTitle": "Black Girl Unbothered",
    "art": "livt",
    "artCredit": "",
    "spotify": "https://open.spotify.com/embed/album/6DvEqxrzVMnE2W67LK4cI6",
    "text": "“Middle fingers to the whole world / if you ain’t down with who I be,” declares this coolly confident R&B singer less than a minute into her latest EP. It’s a breezy assertion, devoid of arrogance, setting the tone for seven blissful tracks imbued with her contagious and unshakable glow. Throughout the short set, the singer and (for at least 90 seconds) rapper seamlessly flashes a variety of looks, from funked up polyrhythmic head-swimmers to sensual neo-soul and the glitchy bounce of closing track “Euphoria.”"
  },
  {
    "num": 10,
    "data": "youryoungbody",
    "artist": "Youryoungbody",
    "albumTitle": "Devotion",
    "art": "youryoungbody",
    "artCredit": "Jordan Rundle",
    "spotify": "https://open.spotify.com/embed/album/4L4vHKtbIC9lbC1RMSwifB",
    "text": "If Siouxsie Sioux was lured to a sketchy vampire club beneath a meatpacking warehouse in a 2020 “Blade” reboot, this is the record the murderous-looking DJ would be blasting through blood-splattered speakers. During its heaviest four-to-the-floor moments, the first full length from darkwave electronic duo Youryoungbody is intensely throbbing, ready to get you sweating through your trench coat at a moonlit cemetery rave — or at least to rock a hotel party across the street from a cybergoth convention. Conversely, Duh Cripe’s spectral vocals soar like a raven through an autumn night’s sky on its cooler, netherworldly electro-pop jams, and “OD” plays like goth kids remixing ’90s Eurodance deep cuts while chewing watermelon Bubble Yum. It’s dark, visceral and a helluva lot of fun."
  },
  {
    "num": 9,
    "data": "tacocat",
    "artist": "Tacocat",
    "albumTitle": "This Mess is a Place",
    "art": "tacocat",
    "artCredit": "Sub Pop",
    "spotify": "https://open.spotify.com/embed/album/7l3uVSD4WCT8pBvrAMlxnB",
    "text": "Few records this year encapsulated the exasperation of post-2016 life as well as <a href=\"https://www.seattletimes.com/entertainment/music/with-sub-pop-debut-tacocat-spikes-beach-balls-at-post-trump-depression/\" target=\"_blank\" rel=\"noopener noreferrer\">Tacocat’s Sub Pop debut</a> — without making you want to smash your head through a CNN-blaring TV. As sky-falling headlines pile up in real time, the Seattle pop-punk darlings neither bury their heads in the sand nor allow themselves to be crushed by their weight, tastefully sprinkling lulz into songs tackling privilege (“Rose-Colored Sky”) and news-cycle despair (“Crystal Ball”), courtesy of Emily Nokes’ sly-as-ever wit. The bubble-gum garage quartet has always balanced politics and surfy good times, and couldn’t be more on-the-nose than they are on “This Mess is a Place.”"
  },
  {
    "num": 8,
    "data": "pedro_the_lion",
    "artist": "Pedro the Lion",
    "albumTitle": "Phoenix",
    "art": "pedro_the_lion",
    "artCredit": "",
    "spotify": "https://open.spotify.com/embed/album/5u76A4Ereo3ABD3E7yXAge",
    "text": "David Bazan never exactly disappeared, but the resurrection of his Pedro the Lion moniker over the last year and change has been a welcomed one. With Pedro’s first album in 15 years, Bazan — joined by Erik Walters and drummer Sean Lane — takes a contemplative drive through his hometown, spurred by a mid-tour layover at his grandparents’ house. With surefire pleasers for longtime Pedro fans, songs like the centerpiece “Quietest Friend” churn and plod with melancholy, weighed down by artifacts from Bazan’s youth that he’s just now unpacking. Through revisiting childhood ghosts with a half-lifetime’s hindsight, “Phoenix” — said to be the introduction of a series of albums based on cities he lived in growing up — is Bazan’s first step in examining how his youth shaped him."
  },
  {
    "num": 7,
    "data": "chastity_belt",
    "artist": "Chastity Belt",
    "albumTitle": "Chastity Belt",
    "art": "chastity_belt",
    "artCredit": "Hardly Art",
    "spotify": "https://open.spotify.com/embed/album/2w90HaDXKJ3WT9WHmYrQEE",
    "text": "Since bopping their way into our hearts with their endearingly lo-fi debut, the former Walla Walla jangle-punks have steadily evolved with each subsequent album. After an aborted tour prompted a short break for the band, Chastity Belt regrouped to complete its tranquil new album, bearing the rewards of the tightknit band’s fluid maturation over four strong albums. The Seattle indie-rock vets sound clearer and more self-assured than ever while rotating vocal duties throughout the somberly lush 10-song set."
  },
  {
    "num": 6,
    "data": "black_tones",
    "artist": "Black Tones",
    "albumTitle": "Cobain & Cornbread",
    "art": "black_tones",
    "artCredit": "Danny Denial",
    "spotify": "https://open.spotify.com/embed/album/1b9wq6uUN4Wu5JsCGBZCnh",
    "text": "Local rock fans love the blues-punk gumbo that the Seattle-born progeny of Southern transplants have slow-cooked to perfection in clubs across town for years. Already established as a top-tier live act, sibling rockers Eva and Cedric Walker followed a <a href=\"https://www.seattletimes.com/entertainment/music/family-bond-carries-seattle-favorites-the-black-tones-through-breakout-year/\" target=\"_blank\" rel=\"noopener noreferrer\">breakout 2018 </a> by nudging the bar higher with their hotly anticipated debut album, “Cobain & Cornbread” — a perfect tagline for their blend of swampy, electrified blues and the more unbridled elements of the Northwest rock canon. Even at a tight eight songs (though half are around six minutes or longer), with healthy splashes of Hendrix, there’s colorful range — from house-leveling punk cyclones to a plucky banjo ditty, a clap-along harmonica hymnal and a twisted psych-riffing instrumental that takes the elevator to the 13th floor."
  },
  {
    "num": 5,
    "data": "travis_thompson",
    "artist": "Travis Thompson",
    "albumTitle": "Reckless Endangerment",
    "art": "travis_thompson",
    "artCredit": "Photo by Ryan McKinnon, Design by Michael Gaertner",
    "spotify": "https://open.spotify.com/embed/album/0JGtwNtJYWO933wzXPdId3",
    "text": "With his major-label follow-up to last year’s confessional “YouGood?” the <a href=\"https://www.seattletimes.com/entertainment/music/buriens-travis-thompson-makes-good-on-reckless-endangerment-the-rappers-first-major-label-album/\" target=\"_blank\" rel=\"noopener noreferrer\"> unofficial mayor of Burien </a> steps up the swagger on his first album <a href=\"https://www.seattletimes.com/entertainment/music/burien-rapper-travis-thompson-signs-major-label-deal-with-epic-records/\" target=\"_blank\" rel=\"noopener noreferrer\"> with Epic Records </a>. There are still plenty of easy-swinging reflective moments, like the strings-laced title track and the Ben Zaidi-assisted “Malice.” But where the <a href=\"https://www.seattletimes.com/entertainment/music/travis-thompson-gets-real-about-mental-health-dark-side-of-success-on-pivotal-new-yougood/\" target=\"_blank\" rel=\"noopener noreferrer\">darker “YouGood?”</a> delved into the head trip he experienced facing pressure to keep his momentum going, here Thompson channels those emotions into more upbeat heaters, ready to blow car stereos from Ambaum Boulevard to Aurora. Thompson’s syllable-stuffing bars and effortless melodies are strong enough to bridge hip-hop’s generational divide, solidifying his place in the Seattle rap canon. While tacitly welcoming Thompson to the club, guest verses from <a href=\"https://www.seattletimes.com/entertainment/music/macklemore-talks-sounders-deal-dave-meinert-and-seattle-hip-hop/\" target=\"_blank\" rel=\"noopener noreferrer\" >mentor Macklemore </a>, Sir Mix-a-Lot and Geo of Blue Scholars on the mic-passing “Glass Ceiling” contribute to the hardest-hitting Seattle anthem since “Posse on Broadway.”"
  },
  {
    "num": 4,
    "data": "somesurprises",
    "artist": "somesurprises",
    "albumTitle": "somesurprises",
    "art": "somesurprises",
    "artCredit": "somesuprises",
    "spotify": "https://open.spotify.com/embed/album/5GQpEhKK7qgFGC8C4J7lNo",
    "text": "Natasha El-Sergany is a master of tension. Throughout this mesmerizing batch of gauzy, lost-in-a-daydream paeans, somesurprises’ principal songwriter repeatedly throws listeners into the eye of delicately crafted psychedelic storms with impressive subtlety. Bathed in reverb, the unhurried songs on one of the year’s most engrossing albums build slowly and methodically, the payoff growing bigger with every ominous churn and eerie guitar and synth accent. A touched-up version of the previously released “Late July” serves as a haunting centerpiece, its foggy vocals and atmospheric guitars slipping in and out like a shadowy figure on the edge of a forest."
  },
  {
    "num": 3,
    "data": "perry_porter",
    "artist": "Perry Porter",
    "albumTitle": "Bobby Ro$$",
    "art": "perry_porter",
    "artCredit": "Izzy Vibes and Perry Porter",
    "spotify": "https://open.spotify.com/embed/album/6CqKqkQ9d30FLXXj2Ap3Qr",
    "text": "Since the breakup of his rowdy mosh-rap group Sleep Steady, Perry Porter has established himself as one of Seattle-Tacoma’s unique talents through infectiously fun hybrid rap/live art shows. The charismatic rapper/painter (or is it painter/rapper?) looks and sounds increasingly comfortable grooving in his own watercolored lane on “Bobby Ro$$,” which arrived this summer with a track-by-track color wheel guide to match the variegated album’s many moods. The man can still annihilate a trap beat with the best of ’em (see: breathless five-alarm banger “Sink or Swim”) while alternately cooling down with beatific cuts like the closing “Watercolor,” which samples artist Kerry James Marshall discussing the dearth of “self-satisfied” black people depicted through art. Porter, who often paints vibrant, bright-colored portraits of black women, is refocusing the narrative while doing equally beautiful things with 808s and acrylics."
  },
  {
    "num": 2,
    "data": "great_grandpa",
    "artist": "Great Grandpa",
    "albumTitle": "Four of Arrows",
    "art": "great_grandpa",
    "artCredit": "",
    "spotify": "https://open.spotify.com/embed/album/3r0yN1Lf0bumujRUandEE2",
    "text": "In executing one of the finer sophomore shake-ups, the reformed slacker-rockers crafted Seattle’s most riveting indie-rock record of the year. Guided by the studio mantra “Go Slow, Bold Choices” (etched on printer paper), the once grunge-indebted quintet shed the charming scruff-around-the-edges of 2017’s very good “Plastic Cough” for more methodical, dynamic songwriting and arrangements. The elegant strings and piano passages, folky acoustic guitars and crying-on-the-inside power-pop jams take a significant leap from the band’s debut, with singer Alex Menne’s emotive, stripped-down vocals sailing over the top with the wind at their back. But ex-Death Cab for Cutie member Chris Walla — a guy who knows a thing or two about making soul-stirring records — said it best with this ringing <a href=\"https://twitter.com/calculizer/status/1194853123648446465\" target=\"_blank\" rel=\"noopener noreferrer\" > Twitter endorsement </a>: “The best album listens to you as you listen to it, as a friend does. It answers old, lingering questions, and asks newer, more relevant ones. And it’s okay when you say goodbye, because you know there’s more to learn and discover. [Great Grandpa] made one of those.”"
  },
  {
    "num": 1,
    "data": "guayaba",
    "artist": "Guayaba",
    "albumTitle": "Fantasmagoria",
    "art": "guayaba",
    "artCredit": "Úna Blue",
    "spotify": "https://open.spotify.com/embed/album/1TPpww7eo2f5DXcHOQ6DqO",
    "text": "Talk about a record worth the wait. Three years ago (an eternity in streaming-era hip-hop), the real-life Olivia Hatfield, who previously performed as avant-soul singer Aeon Fux, released the well-received “Black Trash, White House” — wielding bilingual bars and Latin American influences — and became a club-circuit fixture. An experimental current has long coursed through a faction of Seattle’s eclectic hip-hop scene, one Guayaba gravitated toward alongside fellow Seattle favorites DoNormaal and Taylar Elizza Beth. But with this month-old alt-rap opus, the <a href=\"https://www.seattletimes.com/entertainment/music/surviving-seattle-how-local-musicians-are-coping-with-an-increasingly-expensive-city/\" target=\"_blank\" rel=\"noopener noreferrer\">Tacoma-based rapper/singer </a> has become a creative leader among this vibrant left-of-center coterie. A hair-raising uneasiness runs throughout the album, from the spooky cathedral intro that could open a Cradle of Filth album (not a total shocker coming from this former metal singer) to the horror-flick murder screams that dissolve into a Billie Holiday cover. Beguiling string arrangements drift over lurching click-clacks, with Guayaba shifting between bewitched low-register raps and devil’s-choir vocals across this haunted-to-perfection dreamscape. (Or should we say nightmare?) “Fantasmagoria” is a rabbit hole you absolutely want to fall down."
  }
]